{"message":"success","data":[{"name":"Drawing room","url":"http://www.download3dhouse.com/wp-content/uploads/2013/02/Living-room-3d-model-free.jpg","tips":[{"url":"http://1.bp.blogspot.com/-r5tezLwoKgs/VokuJyqJmVI/AAAAAAAAB0g/SATFF66dFOc/s640/Small%2BLiving%2BRoom%2BDesign%2BMinimalist%2B2016%2B%25235.jpg","message":"Hang canvases painted with interior latex paint to brighten blank walls. Think big: The canvases should fill the wall"},{"url":"https://1.bp.blogspot.com/-qs3mz7Jf66U/V6QZNm9ffLI/AAAAAAAAabY/i8aK0_p8t6kDAMHj1ZHNKyJ8Imjl7IxogCLcB/s640/%25E0%25B9%2584%25E0%25B8%25AD%25E0%25B9%2580%25E0%25B8%2594%25E0%25B8%25B5%25E0%25B8%25A2%25E0%25B9%2581%25E0%25B8%2595%25E0%25B9%2588%25E0%25B8%2587%25E0%25B8%259A%25E0%25B9%2589%25E0%25B8%25B2%25E0%25B8%2599%25E0%25B8%25AA%25E0%25B9%2584%25E0%25B8%2595%25E0%25B8%25A5%25E0%25B9%258C%2B%25E0%25B8%25A3%25E0%25B9%2588%25E0%25B8%25A7%25E0%25B8%25A1%25E0%25B8%25AA%25E0%25B8%25A1%25E0%25B8%25B1%25E0%25B8%25A2.jpg","message":"Create a Side Table -Stack modular storage units (from $22, amazon.com) to make a stepped side table with surfaces for displays and lighting. Create miniature still lifes in the cubbies, or stack reading material that you’re going to get to...someday."},{"url":"http://www.roomsketcher.com/wp-content/uploads/2014/08/RoomSketcher-Interior-Design-Bottom-Gallery-Bottom-Right.jpg","message":"Hang Plates - Plates in unexpected colors make a fresh wall arrangement. Vary hues (within a family), sizes, textures. Put the most dramatic plate toward the center (lay out the plates first to experiment); attach wire plate hangers and hang plates on picture nails."},{"url":"http://www.fwdlife.in/wp-content/uploads/2013/07/Living-room-1.jpg","message":" Make Your Own Art - Even photocopied art looks sophisticated when it floats between two pieces of glass in Umbra’s Document Frames (from $13, umbra.com). The wall color shows through the glass, creating the illusion of a custom mat."},{"url":"http://idolza.com/a/m/h/home-decor-ideas-for-room-design-free-3d-interior-pictures-house-decorating-software-autocad-archicad-architectural-inspiration-decorations_room-design-free_bathroom-ideas-for-a-small_850x532.jpg","message":"Hang a Gallery of Photos - Mine your albums for your best shots (pick a theme: weddings, birthday parties, vacations) and put them in identical frames. Hang in a tight grid or a long line—you can’t go wrong if you stick to a geometric arrangement."}]},{"name":"Bedroom","url":"https://static.pexels.com/photos/237371/pexels-photo-237371.jpeg","tips":[{"url":"https://www.bchydro.com/content/dam/BCHydro/customer-portal/photographs/objects-products/misc-household-items/hotel-bed-folded-towels-object-lg.jpg","message":"Pile on the Pillows - Pile on the pillows, and don’t shy away from mixing patterns. Combine large prints with small ones, florals with geometrics."},{"url":"https://s-media-cache-ak0.pinimg.com/originals/fe/c4/8b/fec48b11adce633d8a5df9553332b14a.jpg","message":"Work the Walls-Nightstands and adjustable lamps affixed to walls smartly save space in a small room."},{"url":"http://www.interieur-inrichting.net/afbeeldingen/houten-wand-slaapkamer1-500x400.jpg","message":"Make Your Bedroom Comfy - Top your bed with covers made for snuggling, like a down comforter. For total indulgence, choose ultra-soft eiderdown."},{"url":"http://tremendouswallpapers.com/wp-content/uploads/2014/12/bedroom-interior-design.jpg","message":"Keep Scale in Mind - Gauge the size of your bedside lamp by the scale of your bed: A four-poster would call for a big fixture; for a low bed, choose something smaller."},{"url":"https://static.vecteezy.com/system/resources/previews/000/150/610/non_2x/free-bedroom-with-bedside-console-vector.jpg","message":"Layer With Color - At the bold end of the scale, go for saturation with a favorite color. Use a variety of tones and textures to give your room a layered feel"}]},{"name":"Kitchen","url":"https://s-media-cache-ak0.pinimg.com/originals/d1/a1/3e/d1a13e22f095dbc68a5a7bb45c8fdf94.jpg","tips":[{"url":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT-qSKNES0KNZXlKNR0gxrBM2_40tD8dkXDfDJOBgSmRDbcYj8k","message":"Black and White - You can stick to a monochromatic palette while still adding interest and personality to a room. A continuous pattern, like this modern black-and-white zigzag, running across a counter or backsplash is graphic and unexpected. If you're short on cabinet space, consider hanging floating shelves to hold frequently used tools or display favorite accessories."},{"url":"http://cubtab.com/daut/as/f/t/the-amazing-of-free-indian-kitchen-interior-design-catalogues-for-ideas-pictures-painoxyz-regarding-in-designs-architecture_indian-model-kitchen-cabinet-ideas_kitchen_south-city-kitchen-decorating-ide.jpg","message":"Morning Glory -It can be challenging to find ample storage in a kitchen that flows into other areas of the home. Think creatively when carving out extra spots for concealing belongings. Need some ideas? Build hidden cabinets and compartments in an island, hang floating shelves on walls, or bring unexpected pieces of furniture (china cabinet, armoire, credenza) into the space."},{"url":"http://acmchome.com/wp-content/uploads/2016/08/httpwww.zquotes.netwp-contentuploads201411Best-Kitchen-Interior-Design-2015.jpg","message":"Sunshine Day - Short on square inches? A tiny kitchen (and a tight budget) requires careful and creative planning. A gray-and-white palette gets a burst of charm from bright pops of lemon and turquoise. If you don't have much cabinet space, bring in freestanding pieces to hold appliances, dishes, and other kitchen essentials."},{"url":"https://is.alicdn.com/img/pb/828/360/360/360360828_577.jpg","message":"High Design - Large vaulted ceilings and multiple windows can make a room feel larger than it actually is. If you're decorating a primarily white-and-black space, bring in an unexpected piece of wood furniture to warm it up and give it personality."},{"url":"https://cdn6.dissolve.com/p/D386_3_355/D386_3_355_0004_600.jpg","message":"Splash of Color - A really great stove can transform a kitchen. For a nice pop of color, consider a pretty splashback like a marine blue glass. To make a kitchen homey and high-functioning, hang storage racks from the ceiling for frequently used pots and pans."},{"url":"http://idolza.com/a/f/i/indian-model-kitchen-cabinet-ideas-imanada-stunning-modern-open-design-with-red-as-well-black-excerpt-appliances_free-kitchen-design-software-for-mac_design-ideas-for-home-ver.jpg","message":"Corner Care - Think beyond the primary functions of the kitchen and consider how it can seamlessly extend into the other areas of your home. When a few rooms spill into the kitchen, it's time to create a balanced flow, which can be accomplished with a cohesive and simplified color palette. Boring? Not a chance. Here, the splashes of red weave into different nooks like the kitchen counter accents, cushioned bench, and living room side chair and window treatments."}]},{"name":"Furniture arrangement","url":"http://hgtvhome.sndimg.com/content/dam/images/hgtv/fullset/2011/3/9/0/Original_Miv-Watts-Indian-living-room-2_s4x3.jpg.rend.hgtvcom.1280.960.jpeg","tips":[{"url":"http://jobbind.com/wp-content/uploads/2016/11/living-room-furniture-arrangement-simple-with-photos-of-decorating-ideas-living-room-free-design-furniture-arrangement-ideas.jpg","message":"Avoid the blandness that may come with a restrained couch by getting more fanciful with decorations. Give a substantial-sized sofa a sense of restful spareness with fabric in a light-as-air color. Inject personality into neutral sofas by adding brightly patterned and colored throw pillows."},{"url":"https://i.ytimg.com/vi/t-9mtimjYzU/maxresdefault.jpg","message":"Commandeer the luggage rack from the guest bedroom and top it with a glass picture frame, for a low-cost side table. Secure the frame at all four corners with an adhesive. Embrace robust colors. (Green has actually been shown to create a sense of calm and comfort.)"},{"url":"http://wrkshp.org/wp-content/uploads/2013/03/IMG_9985.jpg","message":"Dream of cities you’d like to visit (or loved ones who live there) by hanging clocks dedicated to their time zones. Bring out the richness of a hardwood floor with earthy tones―blues, greens, browns."},{"url":"https://i.pinimg.com/736x/3b/6b/47/3b6b47e9d3a08d4a6c2b87580241ef65--room-planner-free-room-layout-planner.jpg","message":"Set up proper lighting to transform a corner of the couch into a reading nook. Pair busy accessories with a simple sofa for mutually beneficial results."},{"url":"http://www.zingyhomes.com/projectImages/SHAHEN_MISTRY/Images20130909073536_living%20area%202bhk%20kandivali.JPG","message":"Watch a Mirror Work - Make a room appear brighter and larger by positioning a mirror to reflect light and a view."},{"url":"https://lh3.googleusercontent.com/8h1uf4Ale28szRB-mGOl6-vYd2d9ooKhY4i1vyD61oo29bV8URPpaydCTLQyuqPVFv0=h556","message":"Give Furniture Different Roles - Repurpose a sleek bath cart to serve as a side table or a minibar, stocked with drinks and snacks."}]},{"name":"Bathroom","url":"http://www.tsc-snailcream.com/images/goooq.com/wp-content/uploads/2016/10/Toilet-And-Bath-Design-Bedroom-Designs-Modern-Interior-Design-Ideas-Photos-Kitchen-Wall-Decor-Ideas-Pinterest-Master-Bedroom-Interior-Design-k43.jpg","tips":[{"url":"https://i.pinimg.com/736x/0d/d3/23/0dd323e4a3a6ed4dd5b5aa363f6af00e--d-interior-design-software-free-home-design-software.jpg","message":"Sunny Delight - Bright and cheery accents can transform a white bathroom. This vintage storage cabinet in vibrant turquoise pairs well with stools in invigorating hues of lemon and baby blue."},{"url":"http://idolza.com/a/f/d/design-small-bathroom-contemporary-ideas_bathroom-modern-design_bathroom-designs-in-small-spaces-craftsman-home-plans-interior-design-house-pictures-modern-photos-of-remodel.jpg","message":"Even a minimal splash of color in a small space will add a big dose of fun. Stick to a soft neutral or white color palette for the walls and fixtures to maximize light then mix in just the right amount of color with the shower curtain, towels or accessories."},{"url":"http://cfile28.uf.tistory.com/image/03319B4050864CE3131D97","message":" Skirt the Issue - Pedestal sinks are ideal for tight spaces but often show exposed plumbing and offer no hidden storage. An easy-to-sew sink skirt will solve both problems, providing style and function to a bathroom. Learn how to whip one up with our step-by-step instructions."},{"url":"http://idolza.com/a/f/b/bathroom-decoration-photo-arrangement-laundry-room-layout-design-archaic-plans-online_design-your-own-home-online-free_modern-home-plans-tips-for-interior-designing-of-homes-design-ideas-sm.jpg","message":" Change the Floor Plan - A cramped floor plan and outdated finishes prompted the remodel of this small master bathroom. Relocating the toilet to the rear wall and adding a wall-mounted sink maximizes the space. The glass mosaic tile feature wall adds movement and draws attention to the high ceilings and skylight. Design by Jennifer Jones"},{"url":"http://writeteens.com/wp-content/uploads/2016/06/indian-simple-bathroom-tiles-india-new-bathroom-designs-for-small-spaces-10-simple-cool-bathroom.jpg","message":" Add Spa-Style Extras - Luxury can be found even in a small space. This bathroom has just a standard-sized tub, but the tile, oversized shower head and accessories turn it into a retreat."}]}]}
